package carenbb.com.hackathon.emotion.joton;

/**
 * Created by HP on 28-Mar-16.
 */
public class DataMotherInfo {
    private String info;
    private String description;
    private int imageResourceId;


    public static final DataMotherInfo[] infos = {
            new DataMotherInfo("গর্ভবতী মায়ের সাধারণ যত্ন",
                    " মায়ের যত্ন\n\n" +
                            "গর্ভাবস্থা থেকেই মায়ের পুষ্টির দিকে খেয়াল রাখতে হবে। কারণ মায়ের সঠিক পুষ্টি ও যত্নের উপর নির্ভর করছে একটি সবল শিশুর জন্ম।\n" +
                            "অনেকেই মনে করেন মা বেশি খেলে বাচ্চা বড় হবে। সে ক্ষেত্রে জন্মের পর মায়ের সমস্যা হবে। তবে মায়ের জন্য মিনারেল, কাবোর্হাইড্রেটের মতো ৬টি উপাদানের প্রয়োজন। এই উপাদানগুলো যখন মায়ের শরীরে পরিমাণ মতো থাকবে তখনই একটি সুস্থ শিশুর জন্ম হবে।\n" +
                            "গর্ভাবস্থায় মায়ের খেয়াল রাখাটাও বেশ জরুরি। এই সময় একজন মাকে ভারী জিনিস তুলতে দেওয়া যাবে না। স্বামীর সঙ্গে পরিবারের অন্য সদস্যদেরও সহানুভূতিশীল হতে হবে।\n" +
                            "একজন মহিলা যখন প্রখম বারের জন্য গর্ভধারন করেন তার কাছে অনেক কিছুই অজানা থাকে, এই সামান্য কিছু অজানা তথ্যের জন্য অনেক ধরনের কুসংস্কার মায়ের উপর চাপিয়ে দেয় অনেকেই। এজন্য গর্ভধারনের পরপরই একজন স্ত্রীরোগ চিকিৎসকের স্মরনাপন্ন হওয়া উচিত। এতে যে শুধু মা সুস্থ্য থাকবে তা নয়, গর্ভের শিশুটির নিরাপত্তাও এর সাথে জড়িত। সাধারনভাবে এ সময়টাকে মা’কে অল্প কিছু নির্দেশ মেনে চলতে হয়, নিচে তেমন কিছু নির্দেশ লিপিবদ্ধ করার চেষ্টা করা হলো।\n" +
                            "\n১. খাদ্যঃ মাকে এ সময় পুষ্টিকর, সহজপাচ্য ও অধিক আমিষ বা প্রোটিনযুক্ত খাবার খেতে হবে। লক্ষ্য রাখতে হবে খাদ্য তালিকায় শাক-সব্জি এমন পরিমানে যেনো রাখা হয় যাতে ভিটামিন এর অভাব না হয়। একজন ৫০ কেজি ওজনের মায়ের জন্য আদর্শ খাবারে নুন্যতম ২৫০০ কিলোক্যালরি শক্তির যোগান থাকতে হবে।\n" +
                            "\n২. বিশ্রাম ও ঘুমঃ একজন গর্ভবতী মাকে একটি সুস্থ্য সন্তান জন্ম দেবার জন্য কিছুটা বাড়তি বিশ্রাম ও ঘুমানোর প্রয়োজন রয়েছে। দিনে ২ ঘন্টা ঘুম সহ দৈনিক নুন্যতম ১০ ঘন্টা ঘুমানো মায়ের জন্য অত্যাবশ্যকীয়।\n" +
                            "\n৩. কোষ্ঠঃ লক্ষ্য রাখা প্রয়োজন মা এর যেনো কোষ্ঠ্যকাঠিন্য দেখা না দেয়, এতে গর্ভের সন্তান্টির উপর চাপ পড়তে পারে, এজন্য নিয়মিত মলাশয় খালি করতে হবে। বেশী বেশী শাক-সবজি খেলে এ সমস্যার হাত থেকে মুক্তি পাওয়া যাবে।\n" +
                            "\n৪. স্তনঃ আরেকটা গুরুত্বপূর্ণ কাজ যেটা মাকে করতে হবে, সেটা হল মা অবশ্যই তার দুধের বোঁটার দিকে খেয়াল রাখতে হবে। কারণ বোঁটা যদি ভোতা থাকে তাহলে শিশুকে দুধ খাওয়াতে অসুবিধা হবে। সে জন্য বোঁটা টিপে টিপে ম্যাসাজ করে চোখা করতে হবে, যাতে শিশু ঠিকমতে দুধ পায়।এসময় স্তন সামান্য বড় হতে পারে, স্তনের বোটায় ও কিছু পরিবর্তন আসে, স্তন সামান্য টনটন করাটাও স্বাভাবিক। এসব কারন মাথায় রেখে স্তনের বিশেষ যত্ন নিতে হবে।এছাড়াও খেয়াল রাখতে হবে বোঁটা ফেটে গেছে কি না। এ জন্য চর্মরোগ বিশেষজ্ঞের পরামর্শ নিতে হবে। নইলে শিশুকে জন্মের পরপর দুধ খাওয়াতে গেলে সমস্যা হতে পারে।\n" +
                            "\n" +
                            "৫. যৌন মিলনঃ গর্ভের প্রথম তিন মাসে যৌন মিলন না করাই উত্তম।বিশেষ করে থার্ড ত্রাইমেস্তারের (তৃতীয় স্তর) সময় একেবারেই নয়। নাহলে পানি ভেঙে যাওয়ার সম্ভাবনা থাকে। গর্ভের শেষ ৬ সপ্তাহ ও যৌন মিলন থেকে বিরত থাকতে হবে। তবে এ নিয়ে কোনো সমস্যা দেখা দিলে আপনার চিকিৎসকের পরামর্শ নিয়ে বিশেষ ভাবে মিলন করা যেতে পারে।\n" +
                            "\n৬. ভ্রমনঃ সম্ভব হলে গর্ভের প্রথম তিন মাস যে কোনো ধরনের লম্বা ভ্রমন এড়িয়ে চলা উচিত।\n" +
                            "\n৭.টিকা :গর্ভের শুরুতেই টিটেনাস এর টিকা নিয়ে নিতে হবে। এই টিকা নেয়ার কারনে সন্তানের কোনো ক্ষতি হবার সম্ভাবনা নেই বরং না নিলে প্রসবের সময় ঝুকির সম্ভাবনা থেকে যায়।\n" +
                            "\n৮.ধূমপান : গর্ভাবস্থায় কোনো অবস্থাতেই মায়ের ধুমপান করা চলবেনা, এমন অভ্যাস থেকে থাকলে সন্তানের ভালোর জন্য ঐ মুহুর্তে তা ত্যাগ করতেই হবে। গর্ভবতী মায়ের সামনে অন্যকেউ ধুমপান করলে তাও শিশুটির ক্ষতির কারন হয়ে দাড়াতে পারে। যেসব মায়ের মদ্যপানের অভ্যাস আছে তাদের এসময়ে এ অভ্যাসটি থেকেও দূরে থাকতে হবে। গর্ভাবস্থায় নেশা জাতীয় দ্রব্য সেবন শিশুর স্থায়ী ক্ষতির কারন হতে পারে।\n",
                    R.drawable.cheese_2),
            new DataMotherInfo("গর্ভবতী মায়ের খাবার",
                    "পুষ্টিকর খাবার একজন মাকে গর্ভাবস্থায় সুস্থ রাখে এবং গর্ভের শিশুকে সুস্থ ও স্বাস্থ্যবান করে তলে। \n" +
                            "একজন গর্ভবতী মাকে সাধারন মানুষের তুলনায় অনেক বেশি খেতে হয় । অতিরিক্ত খাবার তাদের শক্তি ও সক্ষমতা দান করে এবং গর্ভের শিশুকে বেরে উঠতে সাহায্যও করে ।\n" +
                            "একজন গর্ভবতী মায়ের বিভিন্ন  রকম খাবার গ্রহন করা উচিৎ। মায়ের প্রতিদিনের খাবার তালিকায় অবশ্যই নিম্নের ৩ ধরনের পুষ্টি উপাদান থাকতে হবে।\n" +
                            "গর্ভবতী মায়ের খাবারের তালিকা\n" +
                            "শক্তিদায়ক খাবারঃ যেমন\n" +
                            "•\tভাত, রুটি/পরাটা, আলু, চিনি, গুড়, সুজি\n" +
                            "•\tসয়াবিন তেল, বাদাম, কলিজা\n" +
                            "•\tঘি/মাখন, ডিমের কুসুম ইত্যাদি\n" +
                            "শক্তি ক্ষয়পূরণ এবং নবজাতকের শরীর বৃদ্ধিকারক খাবার-যেমনঃ \n" +
                            "•\t মাছ, মাংস, দুধ, ডিমের সাদা অংশ \n" +
                            "•\tবিভিন্ন ধরনের ডাল, মটরশুটি, সীমের বীচি ইত্যাদি \n" +
                            " \n" +
                            "শক্তি রোগ প্রতিরোধক খাবার-যেমনঃ\n" +
                            "•\tসবুজ, হলুদ ও অন্যান্য রঙ্গিন শাক-সবজি \n" +
                            "•\tসবধরনের মৌসুমী ফল-মূল \n" +
                            " \n" +
                            "গর্ভবতী মা কি খাবেন,কি পরিমাণ খাবেন\n" +
                            "•\tপ্রতিদিন তিন ধরণের খাবারের তালিকা থেকেই কিছু কিছু খাবার খেতে হবে। \n" +
                            "•\tপ্রতিবেলায় স্বাভাবিকের চেয়ে একটু বেশী খেতে হবে। \n" +
                            "•\tগভর্বতী মাকে বেশী করে পানি খেতে হবে \n" +
                            "•\tআয়োডিনযুক্ত লবণ তরকারীর সাথে খেতে হবে। তবে অতিরক্ত লবণ খাওয়া যাবে না।\n" +
                            "\n" +
                            "কার্বোহাইড্রেটঃ\n\n" +
                            " আমরা ভাত,ভুট্টা, মিষ্টি আলু, কলা এবং গম হতে উৎপাদিত খাবার থেকে প্রচুর পরিমান কার্বোহাইড্রেট পেতে পারি।\n" +
                            "\n" +
                            "প্রোটিনঃ\n\n" +
                            " বিভন্ন প্রকার মাছ, মাংস, দুধ ডিমে প্রচুর প্রোটিন থাকে। এছারা বাদাম,পনির, সিমের বিচি,ডাল , কাজু বাদাম, ইয়গ্রুট,ও বিভিন্ন  ফলে প্রচুর প্রোটিন থাকে।\n" +
                            "\n" +
                            "ফলমূল ও শাকসবজিঃ \n\n" +
                            "সবুজ শাক সবজি একজন মায়ের জন্য অধিক উপাদেয় খাদ্য ।একজন গর্ভবতী মায়ের নিয়মিত বিভন্ন ফলমূল ও শাক সবজি খাওয়া প্রয়োজন। বাধাকপি, ফুলকপি, ডাটা শাক,মরিচ, টমেটো, পোল্লা, দুধ কুশি , বিভন্ন ধরনের সবুজ শাক, লাল শাক, পালং শাক ইত্যাদি সবজি গ্রহন করতে পারেন।\n" +
                            "আম, জাম, আপেল, কমলা, বেদানা, ডালিম , আঙ্গুর , আখরোট , মালটা, কলা ইত্যাদি বিভন্ন ধরনের ফল একজন গর্ভবতী মা এবং তার শিশুর জন্য অত্যন্ত উপকারী।\n" +
                            "\n" +
                            " \n" +
                            "একজন গর্ভবতী মা যদি সব ধরনের খাবার না খেতে পছন্দ করেন তাহলে তার পছন্দের তালিকার পুষ্টিকর খাবারে সাথে অল্প অল্প করে অন্যান্য পুষ্টিকর খাবার দিতে হবে।\n" +
                            "যদি কোনো পরিবার গর্ভবতী মায়ের জন্য পরিমান মতো ও প্রয়োজনীয় খাবার দিতে ব্যার্থ হয় তবে তার প্রতিবেশী ও শুভাকাঙ্ক্ষীদের এগিয়ে আসতে হবে। গ্রামীন জীবনের ক্ষেত্রে পরিবার বাসার সামনে ছোট বাগান করতে পারেন। প্রতিবেশীরা তার জন্য নিজেদের মুরগির ডিম অথবা বাড়ির গাভির দুধ উপহার দিতে পারেন। নিজেদের জন্য রান্না করা খাবারে কিছু অংশ গর্ভবতী মায়ের জন্য রেখে দিতে পারে। মুল  কথা সবাই মিলে সর্বচ্চো চেষ্টায় একজন মাকে তার জন্য প্রয়োজনীয় পুষ্টি উপাদান সরবরাহ করতে হবে। \n" +
                            "আয়রন এবং ফলিক এসিডঃ একজন গর্ভবতী মায়ের জন্য প্রচুর আয়রন ও ফলিক এসিড প্রয়োজন। আয়রন অ্যামিনিয়া প্রতিরোধে সাহায্য করে। ফলিক এসিড অনাগত সন্তানকে বিকালঙ্গ রোগ হতে প্রতিরোধ করে। বিভন্ন রকম খাবার থেকে আয়রন ও ফলিক এসিড পাওয়া সম্ভব। একজন গর্ভবতী মাকে সন্তান প্রসবের পূর্ব পর্যন্ত প্রতিদিন ৪০০ থেকে ৫০০ মিলিগ্রাম ফলিক এসিড এবং ৩০০ মিলিগ্রাম ফেরাস সালফেট (৬০ গ্রাম) গ্রহন করতে হবে।\n" ,
                    R.drawable.cheese_1),
            new DataMotherInfo("গর্ভাবস্থায় প্রথম ৩ মাস যা মেনে চলতে হবে",
                            "যদিও অনেকটাই বোঝা যায় না, কিন্তু গর্ভাবস্থার প্রথম তিন মাস যে কোন মায়ের কাছেই ভীষণ জাদুকরি বলেই মনে হয়। নতুন প্রাণের আগমনের খবর উদ্বেলিত করে তোলে নতুন মায়ের জীবন। শুধু মায়ের জন্য নয়, সন্তানের জন্যও এই সময়টি খুবই গুরুত্বপূর্ণ হিসেবে বিবেচিত হয়ে থাকে। তাই দরকার সচেতনতার। যেহেতু সন্তানের একদম প্রথম পর্যায় এটি, তাই মাকে হতে হবে অনেক বেশি সতর্ক।\n" +
                                    "কিন্তু বললেই তো আর সতর্ক হওয়া যায়না, কারন অনেক ক্ষেত্রেই মায়েরা বুঝতে পারেন না যে কি হচ্ছে বা কি হতে পারে। অনেকেরই নিজের শারীরিক অবস্থা সম্পর্কে সঠিক জ্ঞান থাকেনা, জানা থাকেনা কিসে সন্তানের ভাল বা খারাপ হতে পারে। তাই সন্তান গর্ভধারণের এই প্রথম পর্যায়টি অনেকের জন্যই হতে পারে ক্ষতিকারক, যদি সঠিক যত্ন না হয়। সন্তান গর্ভধারণের প্রথম পর্যায়ের মায়েদের শারীরিক অবস্থা্র সবকিছু নিয়েই আমাদের এই আয়োজন।\n" +
                                    "প্রথমেই জেনে নিন আপনি প্রেগন্যান্ট কি না। আজকাল প্রেগন্যান্সি কিট কিনতে পাওয়া যায়। তা দিয়ে পরীক্ষা করে দেখতে পারেন। এসব কিট দিয়ে যে পরীক্ষা করা হয় তার মধ্যে প্রায় ৯৫ শতাংশ পরীক্ষাই সঠিক হয় বলে ধরা হয়। তবে ১০০ শতাংশ নিশ্চিত হতে চাইলে ডাক্তারের পরামর্শে আলট্রাসাউন্ড পরীক্ষা করে দেখতে পারেন। নিশ্চিত তো হওয়া গেল, এখন জানা যাক পরবর্তী পদক্ষেপগুলো সম্পর্কে।\n" +
                                    "\uF0A7\tএকবার পরীক্ষা করে নিশ্চিত হয়ে গেলে এর পরে থেকে সাবধানে চলাফেরা করুন। এলকোহল, ক্যাফেইন, ধুমপান থেকে দূরে থাকুন, তা প্রত্যক্ষ বা পরোক্ষ যেমনই হোক না কেন। কারন এই সময় এসব জিনিস অন্য যে কোন কিছুর থেকেই সবচাইতে বেশি ক্ষতি করে বাচ্চার।\n" +
                                    "\uF0A7\tযেহেতু আপনি অন্তঃসত্ত্বা, তাই আপনাকে সবসময় ডাক্তারের পরামর্শ অনুযায়ী চলতে হবে। অতিসত্বর একজন ডাক্তার নির্বাচন করুন। ডাক্তার নির্বাচন করার আগে কিছু জিনিষ মনে রাখবেন। যেমন- ডাক্তারের সাথে যে কোন সময় যোগাযোগ করা সম্ভব কি না, যে কোন দরকারে তাকে পাওয়া যাবে কি না। সেই সাথে দূরত্বটাও খেয়াল রাখবেন। যেহেতু আপনি অন্তঃসত্ত্বা তাই এ সময় বেশি চলাচল করতে পারবেন না। কেননা তা বাচ্চার জন্য ক্ষতিকারক হতে পারে। তাই ডাক্তারের কাছে অল্প সময়ে যেন পৌঁছানো যায় সেটাও খেয়াল রাখতে হবে।\n" +
                                    "\uF0A7\tঅন্তঃসত্ত্বা হবার কারনে শরীরে বেশ কিছু হরমোন পরিবর্তন ঘটে। যার ফলে বমি ভাব, মাথা ঘোরা, খেতে না পারা, শরীর খারাপ ভাব হতে পারে। তবে সবাইকে যে এই সকল পরিস্থিতি পার করতে হয় তাও নয়, অনেক মায়ের মধ্যেই এসবের কোনটি বা কখনও কখনও একটিও উপসর্গ দেখা যায় না। এমন কিছু হলে ভয় পাবেন না, আবার না হলেও ভয় পাবেন না। বেশি বমি হলে সকালে উঠে লেবু পানি খেতে পারেন। আর মাথা বেশি ঘোরালে শুয়ে পড়ুন। কিছুক্ষণ বিশ্রাম নিলে ঠিক হয়ে যাবে।\n" +
                                    "\uF0A7\tএছাড়াও হরমোন ঘটিত পরিবর্তনের কারনে এ সময় স্তনের আকারে পরিবর্তন হওয়া শুরু হয় ধীরে ধীরে। সেই কারণে স্তনে ব্যথা হবে ও স্তন নরম হয়ে যাবে। এমনটা হলে ভয় পাবেন না। মনে রাখবেন এই পরিবর্তন আপনার সন্তানের জন্য জরুরি।\n" +
                                    "\uF0A7\tসন্তান গর্ভে ধারণ করার ফলে কিছু শারীরিক পরিবর্তনও ঘটে। যেহেতু সন্তান জরায়ুতে ধারণ করা হয় ও জরায়ুর অবস্থান থাকে প্রসাবের নালীর উপরে, তাই বাচ্চার বৃদ্ধির সাথে সাথে জরায়ু প্রসাবের নালির উপরে কিছু চাপ ফেলে। ফলে প্রসাবের পরিমান বেড়ে যাবে। এই সমস্যা প্রথম ৩ মাস এবং শেষ ৩ মাসের মধ্যেই প্রবল থাকে বেশি।\n" +
                                    "\uF0A7\tএছাড়াও অনেক অন্তঃসত্ত্বা নারীরই রক্তচাপের সমস্যা দেখা দিতে পারে। কারো রক্তচাপ বেড়ে যেতে পারে, আবার কারো বা কমে যেতে পারে। সেই সাথে দেখা দিতে পারে সুগারের সমস্যা। তাই সন্তানের গর্ভধারণের পরপর ডাক্তারের পরামর্শে সব কিছুর পরীক্ষা একবার করে নিয়ে দেখতে হবে গর্ভাবস্থা স্বাভাবিক আছে কি না। এমন কোনও সমস্যা দেখা দিলে নিয়মিত চেকআপের মধ্যে থাকতে হবে।\n" +
                                    "\uF0A7\tবুক জ্বালা করা এবং কোষ্ঠকাঠিন্যও হতে পারে অনেক মায়ের। অন্তঃসত্ত্বা নারীর খাবার হজম হতে ও পেট খালি হতে অন্য নারীদের তুলনায় বেশি সময় লাগে, কারন গর্ভস্থ বাচ্চার খাবার থেকে পুষ্টি গ্রহন করতে সময় লাগে একটু বেশি। কিন্তু এই কারণটাই গর্ভবতী নারীর জন্য হয়ে যায় কষ্টের কারণ। এর ফলেই গর্ভবতী নারী শিকার হতে পারেন কোষ্ঠকাঠিন্য ও বুক জ্বালা করা রোগের। ঘাবড়ে যাবেন না। দরকার পড়লে ডাক্তারের পরামর্শে কোন ওষুধ সেবন করতে পারেন।\n" +
                                    "\uF0A7\tএছাড়াও একজন গর্ভবতী নারী গর্ভ ধারণ করেছেন এটা জানার পরে আনন্দিত, উদ্বিগ্ন, প্রফুল্ল ও ক্লান্ত ইত্যাদি সব ধরনের অনুভূতি অনুভব করেন। এত সব কিছু এক সাথে মানিয়ে নেয়াটাও একটা বড় ব্যাপার হয়ে দেখা দেয়। অনেকেই ঠিক মত মানিয়ে নিতে পারেন না নতুন পরিস্থিতির সাথে। ফলে শিকার হন মুড সুইং এর। সেই সাথে নানা রকম \"হরমোনাল চেঞ্জ\" এর কারণে রাগ বা খারাপ লাগা অনুভুত হতে পারে। এমন কিছু হলে অধিক উত্তেজনা পরিহার করে চলতে হবে। কারণ বেশি উত্তেজনা গর্ভস্থ সন্তানের জন্য ভাল নয়।\n" +
                                    "\uF0A7\tসঙ্গীর সাথে সম্পর্কের ক্ষেত্রে একটু ধৈর্য ধরুন। মনে রাখতে হবে আপনি যেমন মা হচ্ছেন, তেমনই তিনিও বাবা হচ্ছেন। তার কোন ভুল দেখতে পেলে তার সাথে রাগারাগি না করে সাহায্য করুন, সেই সাথে আপনার কোন কিছু খারাপ লাগলে তাকে জানাতে ভুলবেন না।\n" +
                                    "\uF0A7\tমনে রাখবেন আপনি যে কাজ করছেন তা \"প্রেগন্যান্সি সেফ\" কিনা জেনে নিন। ভারি কোন কাজ একদম করতে যাবেন না। মনে রাখবেন প্রথম তিন মাস খুব সাবধানী হতে হবে কারণ এই তিন মাসেই এবরশনের হার সবচাইতে বেশি থাকে। সেই সাথে এমন খাবার খাবেন না যা বাচ্চার জন্য খারাপ হবে। পেঁপে, আনারসের সাথে সাথে কাঁচা বা আধা সিদ্ধ প্রোটিন যেমন মাছ, মাংস, ডিম এসব পরিহার করে চলতে হবে। প্রোটিন ভালো করে রান্না করে তবেই খাবেন। সেই সাথে গলিত চিজ বা এই জাতীয় খাবারও পরিহার করে চলবেন। প্রথম ৩ মাস খেতে কষ্ট হয়, কিছু খেতে ইচ্ছা করেনা তাও বাচ্চার কথা চিন্তা করে যতটা সম্ভব ততটা স্বাস্থ্যকর খাবার খাওয়ার চেষ্টা করবেন।\n" +
                                    "\uF0A7\tডাক্তারের পরামর্শ মোতাবেক কোন ওষুধ খাবার থাকলে তা খাবেন। এমনকি গ্যাসের সমস্যা বা মাথা ব্যাথা বা জ্বর হলেও ডাক্তারের পরামর্শ ছাড়া ওষুধ খেতে যাবেন না। এতে বাচ্চার ক্ষতি হতে পারে।\n" +
                                    "\uF0A7\tঘুমের সময় বাড়িয়ে দিন। দিনে ৮ থেকে ১০ ঘন্টা করে ঘুমানোর চেষ্টা করবেন। এছাড়াও সারাদিনের কাজের ফাঁকে ফাঁকে হালকা বিশ্রাম নিতে পারেন।\n" +
                                    "মনে রাখবেন সন্তান সবার কাছেই মূল্যবান। সবাই চাইবে সুস্থ সন্তানের জন্ম দিতে। তাই কষ্ট হলেও সন্তানের ভালোর জন্য সাবধানে সবকিছু মেনে চলার চেষ্টা করুন। সেই সাথে নিয়মিত ডাক্তারের সাথে যোগাযোগ রাখুন। বিস্রামে থাকুন, উত্তেজিত থাকবেন না, সেই সাথে উদ্বেগ না হয় এমন কিছু করবেন না ও ভয় পাবেন না। সব থেকে বড় কথা হল নিজের খেয়াল রাখুন। আপনি ভাল থাকলেই আপনার সন্তানও ভাল থাকবে।\n"
                    ,
                    R.drawable.cheese_2),
            new DataMotherInfo("গর্ভকালীন সময়ে মায়ের সাধারন কিছু সমস্যা",
                    "গর্ভকালিন ৫ মাসে \n" +
                            "যে সমস্যা।\n" +
                            "মা হওয়ার সময় একটি মেয়ের শরীর ও মনে ঘটে নানা স্বাভাবিক পরিবর্তন ও প্রতিক্রিয়া। প্রায় প্রতিটি মেয়েরই এমন কিছু শারীরিক সমস্যা দেখা দেয়, যা সহজে মানিয়ে নেওয়ার জন্য চাই কিছু বাড়তি যত্ন। চলুন জেনে নিই এমন পাঁচটি পরিচিত সমস্যার কথা।সকালে…সকালবেলা বিছানা ছাড়ার পরই প্রচণ্ড বমি ভাব, বমি, মাথা ঘোরা—এই উপসর্গের নাম মর্নিং সিকনেস। প্রথম সন্তান ধারণের সময় এটি বেশি হয় এবং দেখা দেয় প্রথম ও দ্বিতীয় মাসেই, তিন মাসের পর সাধারণত সেরে যায়। ২৫ শতাংশ নারীর এই সমস্যা একেবারে নাও হতে পারে। গর্ভাবস্থায় রক্তে কিছু হরমোনের মাত্রা বেড়েযাওয়াই এর কারণ।মর্নিং সিকনেস থেকে রক্ষার উপায়\n" +
                            "১. সকালে একবারে বেশি কিছু না খেয়ে অল্প অল্প করে শুকনো খাবার,যেমন টোস্ট বিস্কুট ও আমিষসমৃদ্ধ খাবার খান।\n" +
                            "২. তৈলাক্ত খাবার এড়িয়ে চলুন, যে খাবার দেখলে বা খেলে বমির উদ্রেক হয় তাও এড়িয়ে চলুন।\n" +
                            "৩. চিকিৎসকের পরামর্শে ওষুধ সেবন করতে পারেন।\n" +
                            "৪. অতিরিক্ত বমি হলে বা পানিশূন্যতা বা লবণশূন্যতা দেখা দিলে অবশ্যই চিকিৎসকের শরণাপন্ন হন\n" +
                            "।পায়ে পানি আসাগর্ভাবস্থায় পায়ে অল্প পানি জমাটা স্বাভাবিক। এ জন্য আতঙ্কিত হওয়ার বা চিকিৎসা নেওয়ারও কিছু নেই।\n" +
                            "১. বেশিক্ষণ পা ঝুলিয়ে বসে থাকবেন না, পায়ের নিচে মোড়া বা টুল দিন।\n" +
                            "২. খাবারে অতিরিক্ত লবণ এড়িয়ে চলুন।\n" +
                            "৩. বিশ্রাম বা ঘুমের সময় পায়ের নিচে বালিশ দিতে পারেন।\n" +
                            "৪. পা অনেক বেশি ফুলে গেলে, যদি দৃষ্টি ঝাপসা হয়ে আসে, মাথা ব্যথা হয় বা রক্তচাপ বেড়ে যায় তবে দ্রুত চিকিৎসকের শরণাপন্ন হন।\n" +
                            "কোমর ব্যথা\n" +
                            "৫০ শতাংশ মেয়ে কোমর ব্যথায় আক্রান্ত হয়। ওজন বৃদ্ধি ও অস্থিসন্ধির শিথিলতা এর জন্য দায়ী। তবে উঁচু হিলের জুতা পরা, প্রস্রাবে সংক্রমণ বা কোষ্ঠকাঠিন্যও এর কারণ হতে পারে। পা উঁচু করে বিশ্রাম নিলে কিছুটা আরাম পাবেন। সঠিক ভঙ্গিতে শোয়া বা বসা, শক্ত বিছানা ব্যবহার করা, কোমরে মালিশ বা সেঁক এবং বেশি ব্যথা হলে পরামর্শ অনুযায়ী ওষুধ খেতে পারেন।\n" +
                            "ঘন ঘন প্রস্রাব\n" +
                            "৮ থেকে ১২ সপ্তাহে এই বিরক্তিকর সমস্যা দেখা দেয়। জরায়ুর আকার বড় হওয়ার কারণে মূত্রথলিতে চাপ দেয় বলে এমন ঘটে। ১২ সপ্তাহের পরসেরে গেলেও শেষ দিকে শিশুর মাথা নিচে নামতে শুরু করলে মূত্রথলিতে চাপ দিলে আবার দেখা দেয়। প্রস্রাবে জ্বালাপোড়া বা তলপেটে ব্যথা না থাকলে এ নিয়ে দুশ্চিন্তার কিছু নেই।পেট শক্ত হয়ে আসামাঝেমধ্যে পেশির সংকোচনের জন্য পেট শক্ত হয়ে আসে। সাধারণত ব্যথা থাকে না এবং একটু পর নিজেইচলে যায়। তবে ব্যথা যদি থাকে ও তীব্রতা বাড়তে থাকে সে ক্ষেত্রেচিকিৎসকের পরামর্শ নিন। কোষ্ঠকাঠিন্য বা প্রস্রাবে সংক্রমণ থাকলে চিকিৎসা করুন।\n" +
                            "\n" +
                            "শারীরিক দুরবলতাঃ \n\n" +
                            "কিছু কিছু ক্ষেত্রে গর্ভবতী মহিলারা খুব বেশি ক্লান্ত ও দুর্বল হয়ে পরেন। এটি সাধারনত গর্ভধারনের প্রথম দিকে (প্রথম ৩ মাস) বেশি দেখা যায়।\n" +
                            "এই সময় দুর্বলতা বা বেশি ক্লান্ত লাগা স্বাভাবিক। এই সময় তার প্রয়োজন বেশি বেশি বিশ্রাম। কিন্তু স্বাভাবিকের থেকে বেশি দুর্বলতা বিভিন্ন রোগের লক্ষন হতে পারে। যেমন হতাশা, অসুস্থতা, অ্যানিমিয়া ।\n" +
                            "\n" +
                            " অতিরিক্ত শ্রাব নিঃসৃত হওয়াঃ\n" +
                            " গর্ভাবস্থায় শ্রাব নিঃসৃত হওয়া স্বাভাবিক। গর্ভধারনের শেষের দিকে শ্রাবের পরিমান বৃদ্ধি পায়।। শ্রাব সাধারনত বর্ণহীন হয়ে থাকে, মাঝে মাঝে হাল্কা হলুদাভ হতেও দেখা যায়। এটা খুব স্বাভাবিক।  যদি অধিক পরিমান সাদা ও আঠালো শ্রাব নিঃসৃত হতে থাকে এবং যোনির ভেতরে চুলকায় তাহলে ইষ্ট সংক্রামন এর যথেষ্ট সম্ভাবনা আছে।\n" +
                            "দুর্গন্ধ যুক্ত শ্রাব নির্গমন ও অধিক পরিমান শ্রাব নির্গমন এবং সাথে পেট ব্যথা যৌন সংক্রামন রোগের লক্ষন হতে পারে। এই ক্ষেত্রে খুব দ্রুত স্বাস্থ্য কর্মীর সাথে যোগাযোগ করতে হবে। \n" +
                            "\n" +
                            "বমি ভাবঃ \n" +
                            "গর্ভাবস্থার প্রথম দিকে অনেক ক্ষেত্রে বমি বমি ভাব হতে পারে। অধিকাংশ ক্ষেত্রে এমন দেখা যায়। এটা খুব স্বাভাবিক। এই সময় মায়ের উচিৎ হাল্কা টক জাতীয় কিছু খাওয়া। এবং বিশ্রাম নেয়া। \n" +
                            "\n" +
                            "ক্ষুদা মন্দা  অথবা বেশি বেশি খুদা লাগাঃ\n" +
                            "গর্ভাবস্থায় প্রথম দিকে ক্ষুদা মন্দা দেখা দিতে পারে। এই সময় খাবারে প্রতি অরুচি, খাবার দেখলে বমি ভাব আসতে পারে। এইসময় অল্প অল্প করে বার বার খাবার অভ্যাস করতে হবে।\n" +
                            "কোনো কোনো ক্ষেত্রে দেখা যায় গর্ভাবস্থায় কোনো একটা খাবারের প্রতি খুব বেশি আগ্রহ থাকে। খাবার গুলো যদি স্বাস্থ্য সম্মত হয় যেমন দুধ, ফল মূল,ডিম তাহলে কোনো সমস্যা নেই। কিন্তু খাবার গুলো যদি জাংক ফুড হয় যেমন সোডা, বারগার, ক্যন্ডি তাহলে এই  অভ্যাস অবশ্যই ত্যাগ করতে হবে।  সব সময় স্বাস্থ্য সম্মত ও পুষ্টিকর খাবার খাওয়ার চেষ্টা করতে হবে।\n ",
                    R.drawable.cheese_2),
            new DataMotherInfo("গর্ভকালীন সময়ে ঝুকিপুর্ন লক্ষণ সমূহ",
                    "গর্ভকাল অন্য সময়ের চেয়ে আলাদা। এসময় একই দেহে দু’টি প্রাণের বসত। জন্মদান প্রক্রিয়াও জটিল।\n" +
                            "\n" +
                            "মনে রাখতে হবে আমাদের দেশে প্রসবকালে মাতৃ ও শিশুমৃত্যুর হার বেশি। মাতৃমৃত্যু ও শিশুমৃত্যু হার আমাদের দেশে আগে তুলনায় অনেক কমেছে কিন্তু এখনও যে পর্যায়ে আছে তা যথেষ্ট উদ্বেগের। \n" +
                            "\n" +
                            "গর্ভকালীন মাকে বাড়তি যত্ন নিতে হবে তার পরিবার থেকে। মায়ের ও অনাগত শিশুর পুষ্টি নিশ্চিত করতে হবে। \n" +
                            "\n" +
                            "তবে নিচের পাঁচটি বিষয় গর্ভবতীর মধ্যে থাকলে সঙ্গে সঙ্গে ব্যবস্থা নিতে হবে। সেগুলো হলো :\n" +
                            "\n" +
                            "১. হঠাৎ রক্তপাত শুরু হলে :\n" +
                            "প্রসবের সময় ছাড়া গর্ভাবস্থায় যেকোনো সময় রক্তক্ষরণ বা প্রসবের সময় বা প্রসবের পর খুব বেশি রক্তক্ষরণ বা গর্ভফুল না পড়া বিপদের লক্ষণ। তাই এ রকম পরিস্থিতির সৃষ্টি হলে কোনো রকম চিন্তা না করে পরিবারের সবারই উচিত মাকে দ্রুত নিকটস্থ স্বাস্থ্যকেন্দ্রে নিয়ে যাওয়া এবং ডাক্তারের শরণাপন্ন হওয়া। অন্যথায় তা বাচ্চা এবং মা দু’জনের জীবনেই হুমকি ডেকে আনতে পারে।\n" +
                            "\n" +
                            "২. খিচুনি হলে :\n" +
                            "গর্ভাবস্থায়, প্রসবের সময় বা প্রসবের পর যেকোনো সময় যদি খিচুনি দেখা দেয় তবে দেরি না করে সঙ্গে সঙ্গে বিশেষায়িত হাসপাতালে মাকে ভর্তি করাতে হবে। খিচুনি একলামসিয়ার প্রধান লক্ষণ। তাই দ্রুত পদক্ষেপ ও চিকিৎসায় বাচ্চা এবং মা দু’জনের জীবনকেই রক্ষা করতে পারে। তা না হলে এ রোগে দু’জনই মারা যেতে পারে।\n" +
                            "\n" +
                            "৩. চোখে ঝাপসা দেখা বা তীব্র মাথাব্যথা হলে :\n" +
                            "গর্ভাবস্থায়, প্রসবের সময় বা প্রসবের পর শরীরে পানি আসা, খুব বেশি মাথাব্যথা বা চোখে ঝাপসা দেখা পাঁচটি প্রধান বিপদ চিহ্নের মধ্যে একটি। তাই এ ব্যাপারে মায়েদের বিশেষ সতর্ক থাকতে হবে। যদিও গর্ভাবস্থায় মায়ের পায়ে সামান্য পানি আসা খুব একটা অস্বাভাবিক নয়। একটু বেশি হাঁটলে এ পানি চলেও যায়। কিন্তু যদি পায়ে অতিরিক্ত পানি আসে এবং অস্বস্তির সৃষ্টি করে ও পা ভারি হয়ে আসে তবে ডাক্তারের সঙ্গে যোগাযোগ করা উচিত।\n" +
                            "\n" +
                            "৪. ভীষণ জ্বর হলে :\n" +
                            "গর্ভাবস্থায় বা প্রসবের পর তিন দিনের বেশি জ্বর বা দুর্গন্ধযুক্ত স্রাব প্রধান বিপদ চিহ্নের একটি। বিশেষ করে গর্ভাবস্থায় যদি কেঁপে কেঁপে ভীষণ জ্বর আসে এবং প্রসাবের সময় জ্বালাপোড়া হয় তবে তা অনেক সময় মূত্রনালির সংক্রমণের ইঙ্গিত বহন করে। সময়মতো উপযুক্ত চিকিৎসা করলে অল্প সময়ে এ জটিলতা দূর হয়ে যায়।\n" +
                            "\n" +
                            "৫. বিলম্বিত প্রসব হলে :\n" +
                            "প্রসবব্যথা যদি ১২ ঘণ্টার বেশি হয় অথবা প্রসবের সময় যদি বাচ্চার মাথা ছাড়া অন্য কোনো অঙ্গ বের হয়ে আসে, তবে বাসাবাড়িতে প্রসবের চেষ্টা না করে সবারই উচিত মাকে নিকটস্থ স্বাস্থ্যকেন্দ্রে নিয়ে যাওয়া।\n" +
                            "অতিরিক্ত চাপ মায়েদের স্বাস্থ্য ঝুকি সৃষ্টি করে অথবা নির্দেশ করে ডাক্তার এর সাহায্য ছাড়া বাচ্চা প্রসব করা সম্ভব হবে না। \n" +
                            "অত্যন্ত বেশি চাপের পর করনীয়ঃ\n" +
                            " গর্ভবতী  মা চাপ চালিয়ে যাওয়ার ১২ ঘন্টা পরেও যদি মা শক্ত সমর্থ থাকেন এবং ২ ঘন্টার বেশিচাপ দেয়ার পরেও বাচ্চা প্রসব  হওয়ার লক্ষণ না থাকলে \n" +
                            "যদি মায়ের ২ থেকে ৩ মিনিট পর পর সংকোচন না  ঘটে  এবং স্বাভাবিক ভাবে কথা বলতে পারে তাহলে বুঝতে হবে তার সন্তান প্রসবের নির্ধারিত সময় হয় নি\n" +
                            "তখন তাকে ঘুমানোর জন্য উৎসাহিত করতে হবে। \n" +
                            "যদি গর্ভবতি মায়ের ঘুম না আসে তাহলে অল্প হাঁটা কিংবা কিছু হালকা শারীরিক ব্যায়ামের পরামর্শ দিতে হবে ।\n" +
                            "গর্ভবতী মাকে  হালকা পানীয় ও খাবার খেতে সাহায্য করতে হবে ।\n" +
                            "৬.পানি ভেঙ্গেছে কিন্তু লেবার এখনো শুরু হয় নাইঃ\n" +
                            "বেশিরভাগ মহিলা পানি ভাঙ্গার ১২ ঘণ্টার মধ্যে সন্তান জন্ম দেন। \n" +
                            "পানি ভাঙ্গার ১২ ঘন্টার মধ্যে যদি লেবার শুরু না হয় তাহলে মা ও শিশু মারাত্মক ঝুকিতে পড়ে ।\n" +
                            "এই অবস্থায় করনীয় :\n" +
                            "মা তার যোনি দ্বার এ কিছু রাখবে না এটি ইনফেকশন এর কারন হতে পারে ।\n" +
                            "লেবার বাড়ানোর চেষ্টা করতে হবে ।যদি কয়েক ঘন্টার মধ্যে লেবার শুরু না হয় তাহলে তাকে নিকটস্থ সাস্থ কেন্দ্রে ভর্তি করতে হবে ।\n" +
                            "বি দ্রঃ কখনো লেবার শুরু হওয়ার জন্য ইঞ্জেকশন ব্যাবহার করা যাবে না এটি মা ও শিশুর মৃত্যু পর্যন্ত  ঘটাতে পারে ।\n" +
                            "যদি মায়ের জ্বর চলে আসে অথবা যোনি দিয়ে দুরঘন্ধযুক্ত তরল বের হয় তাহলে বুঝতে হবে ইনফেকশন শুরু হয়েছে ।হাসপাতালে এ নিয়ে যাওয়ার পথে আন্টিবাইয়োটিক দিতে হবে।\n" +
                            "৭.সবুজাভ বা বাদামী তরল নির্গমনঃ\n" +
                            " সবুজাভ বা বাদামী পানির অর্থ হল শিশু জরায়ুর মধ্যে সংক্রামিত অবস্থায় আছে । শিশু বিপদেও থাকতে পারে । সংক্রামণ শিশুর নাক বা মুখে ঘটলে পর্যাপ্ত শ্বাসপ্রশ্বাস গ্রহনে সমস্যা হতে পারে ।\n" +
                            "করনীয়ঃ\n" +
                            "গর্ভবতী মায়ের যদি চাপ চলতে থাকে এবং সন্তান প্রসব এর সময় এগিয়ে আসে তাহলে নবজাতকের মুখ পরিষ্কার করার জন্য প্রস্তুত থাকতে হবে ।\n" +
                            "নবজাতকের মাথা বের হলে যত দ্রুত সম্ভব কাপড় , কাগজ বা সাকশন বাল্ব  দিয়ে মাথা ও নাক পরিষ্কার করতে হবে \n" +
                            "নবজাতক এর শ্বাসকষ্ট হলে কয়েক মিনিটেই চামড়া নীল হয়ে যাবে এবং যত দ্রুত সম্ভব তাকে হাঁসপাতাল এ ভর্তি করতে হবে। \n" +
                            "\n" +
                            "\n" +
                            "\n" +
                            "গর্ভবতীকে লক্ষ রাখতে হবে :\n" +
                            "গর্ভবতী মায়েদেরও কিছু বিষয়ে বিশেষ সতর্ক থাকতে হবে \n" +
                            "\n" +
                            "বাচ্চার নড়াচড়া\n" +
                            "গর্ভাবস্থায় সাধারণত মা ১৬ থেকে ২০ সপ্তাহের মধ্যে বাচ্চার নড়াচড়া অনুভব করেন। পেটের ভেতর বাচ্চা ঘুমায় ও খেলা করে, যার অনুভূতি মা বাইরে থেকে বুঝতে পারেন। বাচ্চার নড়াচড়ার একটা নির্দিষ্ট সীমা এবং সময় রয়েছে যা শুধু মা-ই অনুভব করেন। এর কোনো ব্যতিক্রম হলে মা সেটা খুব দ্রুত বুঝতে পারেন। বাচ্চার অধিক নড়াচড়া বা কম নড়াচড়া দু’টিই ক্ষতিকর এবং এসব ক্ষেত্রে নিয়মিত এবং নির্দিষ্ট সময় পরপর ডাক্তারকে দেখানো উচিত।\n" +
                            "\n" +
                            "রক্তচাপ বেড়ে যাওয়া\n" +
                            "গর্ভাবস্থায় বা প্রসবের পর মায়ের রক্তচাপ লক্ষ রাখা জরুরি। উচ্চ রক্তচাপ অনেক সময় মায়ের জীবনের জন্য হুমকি হয়ে দাঁড়ায় এবং এটি একলামসিয়ার একটি লক্ষণও। তাই যাঁরা আগে থেকেই রক্তচাপে আক্রান্ত বা গর্ভাবস্থায় উচ্চ রক্তচাপে আক্রান্ত হয়েছেন, তাদের উচিত ডাক্তারের পরামর্শ মোতাবেক ওষুধ সেবন করে রক্তচাপ নিয়ন্ত্রণে রাখা এবং নিজ ও বাচ্চা উভয়ের সুস্থতা নিশ্চিত করা।\n" +
                            "\n" +
                            "তলপেটে তীব্র ব্যথা:\n" +
                            "গর্ভাবস্থার প্রথম দিকে (সাধারণত তিন মাসের মধ্যে) যদি কোনো সময় তলপেটে তীব্র ব্যথা অনুভূত হয়, রক্তক্ষরণ ও পেট শক্ত হয়ে যায় তবে দ্রুত ডাক্তারকে দেখানো উচিত। এ ক্ষেত্রে জরায়ু ছাড়া নালিতে (অন্যান্য স্থান যেমন : পেটের ভেতর, ডিম্বাশয়ের মধ্যে ইত্যাদি) গর্ভধারণ (যা একটোপিক প্রেগন্যান্সি নামে পরিচিত) হয়ে থাকে এবং অনেক সময় এটি ফেটে গিয়ে মায়ের জীবনকে মৃত্যুর মুখে ঠেলে দেয়। এ ক্ষেত্রে দ্রুত অপারেশন ছাড়া মাকে বাঁচানো কঠিন হয়ে পড়ে।\n" +
                            "\n" +
                            "তাই গর্ভাবস্থায় প্রথম ৩৬ সপ্তাহে নূন্যতম প্রতি মাসে একবার এবং ৩৬ সপ্তাহের পর প্রতি সপ্তাহে একবার করে মাকে স্বাস্থ্যকর্মী বা ডাক্তার দেখানো উচিত।\n",
                    R.drawable.cheese_3),
            new DataMotherInfo("গর্ভবস্থায় দৈহিক মিলন ও সতর্কতা",
                    " যদি আপনার স্ত্রীর গর্ভকালীন সময় স্বাভাবিক ভাবে চলমান থাকে তাহলে আপনি সন্তান গর্ভে থাকা অবস্থায়ও তার সাথে সহবাস করতে পারেন। তবে এ ক্ষেত্রে কিছু নিয়ম কানুন অনুসরণ করলে কোনো প্রকার বিপত্তির সম্ভাবনা থাকে না। আবার কিছু কারন আছে যার ফলে গর্ভকালীন সময়ের নির্দিষ্ট কিছু সময়ব্যপ্তিতে যৌন মিলন করা থেকে বিরত থাকা জরুরি।\n" +
                            "\n" +
                            "যে কারনে গর্ভকালীন সময় যৌনমিলন থেকে বিরত থাকা উচিত:-\n" +
                            "কোন কারনে যৌনাঙ্গ থেকে রক্তক্ষরন হলে:-গর্ভকালীন সময়ে অল্প কিংবা বেশি রক্তক্ষরন পরিলক্ষিত হলে শাররীক মিলন থেকে বিরত থাকতে হবে।\n" +
                            "\n" +
                            "প্রাক প্রসব বেদনা:- বীর্যের সংশ্চর্ষে প্রোস্টাগ্লেনডিনস্ সংকুচিত হবার সম্ভাবনা থাকে যা প্রাক-প্রসব-বেদনাকে ঝামেলাপূর্ণ করে তুলতে পারে। \n" +
                            "\n" +
                            "জরায়ুর গলদেশে সমস্যা থাকলে:- যদি আপনার জরায়ুর মুখ অকালে খুলতে শুরু করে তাহলে শারীরিক মিলন করলে রোগ সংক্রমনের সমুহ সম্ভাবনা থাকে। \n" +
                            "\n" +
                            "গর্ভের ফুল/অমরা সমস্যায় থাকলে:- যদি গর্ভের ফুল/অমরা জরায়ুমুখ আংশিক কিংবা সম্পুর্নরূপে ঢেকে ফেলে তাহলে শাররীক মিলনের ফলে রক্তপাত এবং প্রাক প্রসব বেদনা শুরু হয়ে যেতে পারে। \n" +
                            "\n" +
                            "যৌন-সংক্রামন ব্যাধি:- আপনার কিংবা আপনার স্বামীর কোন প্রকার যৌন-সংক্রামন ব্যাধি থাকলে গর্ভকালীন শাররীক মিলন থেকে বিরত থাকতে হবে।\n" +
                            "যদি আপনার ডাক্তার আপানাকে গর্ভকালীন শাররীক মিলন থেকে বিরত থাকতে বলে তাহলে খুজে বের করুন ডাক্তার কি বলতে চেয়েছে? ডাক্তার কি শাররীক মিলন থেকে বিরত থাকতে বলেছে নাকি যৌন উত্তেজনা/তৃপ্তি থেকে বিরত থাকতে বলেছে? আর যদি ডাক্তার বারন করে তাহলে অবশ্যই জেনে নিবেন – কত সময়ের জন্য বারন করেছেন? উদাহরন স্বরূপঃ অনেক নারীর গর্ভধারনের প্রাথমিক ধাপে (প্রথম তিনমাস সময়ে) যদি অল্প পরিমান রক্তক্ষরন হয় তাহলে ডাক্তার বলেন শেষ বার রক্তক্ষরনের পর কমপক্ষে এক সপ্তাহ সময়কাল মিলন/অন্যকোন ভাবে যৌন তৃপ্তি থেকে বিরত থাকেন।\n" +
                            "\n" +
                            "গর্ভবতী নারীর জন্য আরামদায়ক যৌন আসন ভঙ্গি:-\n" +
                            "গর্ভকালীন সময় অন্য সময়কালের মত আসনভঙ্গিতে শাররীক মিলন করা যায়না। এটি মা এবং সন্তান উভয়ের জন্য ক্ষতির কারন হতে পারে। তাই এই সময়কালে যৌন আসন সম্পর্কে সাবধানতা অবলম্বন করা জরুরী।\n" +
                            "\n" +
                            "নারী উপরে:-\n" +
                            "এ আসনে নারীর নিয়ন্ত্রন থাকে কত গভীরতায় লিঙ্গ প্রতিস্থাপন করা হবে। এ পদ্ধতিতে বেশিরভাগ কার্যক্রম নারী নিজের ইচ্ছে/সুবিধা মত করতে পারেন। এই ভঙ্গিতে গর্ভের পুরো সময়কাল এমনকি শেষ সময়েও নারী অনেক কম ঝুকিতে থাকেন।\n" +
                            "\n" +
                            "একপাশে কাত হয়ে শুয়ে মিলন:-\n" +
                            "এ আসনে নারী হাটেু ভেঙ্গে পাশে কাত হয়ে শুবেন এবং স্বামী স্ত্রীর পিছেনে থেকে শাররীক মিলন করবেন। স্পুনিং ভাল ভাবে কাজ করে যদি পুরুষ নারীর ঊরূর মাঝে দিয়ে লিঙ্গ সঞ্চালন করেন। এ পদ্ধতিতে তলপেটে কোন চাপ পড়েনা এবং আস্তে আস্তে মিলন করার সুবিদা থাকে যা গর্ভবতীর জন্য জরুরী।\n" +
                            "\n" +
                            "হাটু এবং হাতে ভর:-\n" +
                            "এই ভঙ্গিটি দেখতে হামাগুড়ি দিয়ে হাটার সময় শরীরের যে রকম আকার হয় সেরকম। এই ভঙ্গিটিও গর্ভবতী নারীর জন্য ভাল – এতে পেটে কোন প্রকার চাপ পড়েনা।\n" +
                            "\n" +
                            "অনেক বিবাহিত যুগল এই ভেবে উদ্বিগ্ন থাকেন যে – গর্ভবতী অবস্থায় শাররীক মিলন করলে গর্ভের সন্তান নষ্ট হয়ে যাবার সম্ভাবনা থাকে, প্রধানতঃ গর্ভধারনের প্রথম তিন মাস সময়কালে। সাধারনত প্রাথমিক পর্যায়ে ভ্রুন নষ্ট হওয়া ক্রোমোজোম অস্বাভাবিকতা অথবা নিষিক্ত ডিম্বানু ভ্রুনে রূপান্তরিত হবার সময়কালে অন্যান্য সমস্যার সাথে সম্পর্কিত – যৌন মিলনের ফলে ভ্রুন নষ্ট হবার ধারনাটি ভুল। আশা করি বিষয়টি বুঝতে পেরেছেন। ধন্যবাদ। \n",
                    R.drawable.cheese_3),
            new DataMotherInfo("প্রসবের সময় ঝুঁকিপূর্ণ লক্ষন সমুহ",
                    "অতিরিক্ত রক্তপাতঃ  \n" +
                            "গর্ভাবস্থায় অতিরিক্ত রক্তপাত মা এবং তার অনাগত শিশুর জন্য খুব বিপদ জনক। যদি গর্ভধারনের প্রথন দিকে অতিরিক্ত রক্তপাত অনাগত শিশুর জন্য গর্ভাবস্থায় মৃত্যুর কারন হতে পারে, এবং  এটি মা এর জন্য খুব ক্ষতিকারক। কোনো কোনো ক্ষেত্রে  অতিরিক্ত রক্তপাত মাকে মৃত্যুর দিকে নিয়ে যেতে পারে।    \n" +
                            "তীব্র পেট ব্যথা\n" +
                            "গর্ভাবস্থায় তীব্র পেট ব্যথা (রক্তপাত সহ/ রক্তপাত ছাড়া) নির্দেশ করে যে অমরা জরায়ু থেকে আলাদা হয়ে গেছে।\n" +
                            "আরো কিছু লক্ষন রয়েছে যেগুলো থেকে বোঝা যাবে যে অমরা জয়ায়ু থেকে আলাদা হয়েছে। যেমনঃ \n" +
                            "১. সঙ্কোচন খুব তাড়াতাড়ি শুরু হওয়া।\n" +
                            "২. সঙ্কোচনের সময় কমর এবং পেট ব্যথা।\n" +
                            "৩. খুব সহজেই সঙ্কোচন হওয়া।    \n" +
                            "উচ্চ রক্তচাপ এবং প্রি-অ্যাক্লামসিয়াঃ\n" +
                            "গর্ভাবস্থায় উচ্চ রক্তচাপ বিপদজ্জনক। উচ্চ রক্ত চাপ প্রি-অ্যাক্লামসিয়া এর কারন হতে পারে।\n" +
                            "প্রি-অ্যাক্লামসিয়া এর লক্ষন সমুহঃ\n" +
                            "১. উচ্চ রক্তচাপ থাকবে। রক্তচাপ ১৪০/৯০ অথবা এর বেশি থাকবে।\n" +
                            "২. মুত্রের সাথে অধিক পরিমান প্রোটিন নিঃসৃত হবে। \n" +
                            "প্রি-অ্যাক্লামসিয়া অপরিনত শিশু জন্মানর কারন হতে পারে। \n" +
                            "কোনো কোনো ক্ষেত্রে এটি মা কে অজ্ঞান এবং প্রচণ্ড দুর্বল করে দেয়। কোনো ক্ষেত্রে এটি মায়ের মৃত্যুর কারন হতে পারে। \n" +
                            "\n" +
                            "কোনো গর্ভবতী মায়ের উচ্চ রক্তচাপ থাকলে তা নিয়মিত পর্যবেক্ষণ করতে হবে, অন্তত প্রতি সপ্তাহে একবার। যদি উচ্চ রক্তচাপ দেখা যায় তাহলে প্রি- অ্যাক্লামসিয়ার অন্যান্য লক্ষন গুলো পর্যবেক্ষণ করতে হবে। এবং দ্রুত স্বাস্থ্যকর্মীর সাথে যোগাযোগ করতে হবে।    \n" +
                            "নেতিয়ে পরা বা অজ্ঞান হয়ে যাওয়াঃ\n" +
                            "নেতিয়ে পরা বা অজ্ঞান হয়ে যাওয়া গর্ভবতী মায়ের জন্য বিপদজ্জনক। এই সময় নিচের লক্ষন সমুহ প্রকাশ পাবেঃ\n" +
                            "১. চোখ উল্টিয়ে যেতে পারে।\n" +
                            "২. শরীর শক্ত হয়ে যাবে।\n" +
                            "৩. শরীরের পেশী সমুহ খিঁচে আসবে।\n" +
                            "৪. শরীর নিল হয়ে যাবে।\n" +
                            "৫. মুখ দিয়ে নিঃশ্বাসের সময় বুদ বুদ সৃষ্টি হতে পারে।\n" +
                            "৬. কোনো রকম জ্ঞান না থাকা।\n" +
                            "\n" +
                            "এই মুহূর্তে করনীয় বিষয়াদিঃ\n" +
                            "১. শান্ত থাকা।\n" +
                            "২. জোর পূর্বক মায়ের মুখে কিছু না দেয়া। তার আসে পাশ ফাকা রাখা এবং মুখ ফাকা রাখা। যাতে তিনি সহজে নিশ্বাস নিতে পারেন। \n" +
                            "৩. গর্ভবতী মাকে কাঁত করে শুয়ে রখা যেন বমি না হয়।\n" +
                            "৪. গর্ভবতী মায়ের শরীর থেকে চুলের কাঁটা সেফটিপিন জাতীয় দ্রব্যাদি সরিয়ে ফেলা যেন মায়ের কোনো রকম শারিরিক ক্ষতি না হয়।\n" +
                            "৫. গর্ভবতী মাকে অক্সিজেন দেয়া(যদি সম্ভব হয়)।\n" +
                            "৬. গর্ভবতী মাকে ম্যাগনেসিয়াম সালফেট দেয়া(যদি আপনি এর ব্যাবহার জানেন)।   \n" +
                            " \n",
                    R.drawable.cheese_3),
            new DataMotherInfo("সন্তান জন্মের পরে বিপদজনক লক্ষণ",
                    "সন্তান জন্মের পরে জ্বরঃ \n" +
                            "যদি কোন মায়ের সন্তান জন্মের প্রথম সপ্তাহে জ্বর হয় তার জরায়ুতে ইনফেকশন হতে পারে \n" +
                            "জরায়ু আক্রান্ত হওয়ার ৩ টা  লক্ষণ আছে\n" +
                            "১ । চিলস \n" +
                            "২ । পেটে ব্যাথা অথবা পেট ফাপা ।\n" +
                            "৩ । যোনি দ্বার দিয়ে দুর্গন্ধ যুক্ত তরল নিঃসৃত হাওয়া ।\n" +
                            "অতিরিক্ত রক্তপাতঃ\n" +
                            "সন্তান জন্মের পরে সামান্য রক্তপাত প্রতিটা গর্ভবতী মায়ের জন্য সাধারণ বিষয়।কিন্তু অতিরিক্ত রক্তপাত মায়ের জন্য বিপদজ্জনক। কখনো কখনো এটি মায়ের মৃত্যুর কারন হতে পারে।\n" +
                            "অতিরিক্ত রক্তপাতের লক্ষন সমূহঃ \n" +
                            "১। যদি ২ বা ততোধিক কাপড রক্তে ভিজে যায় \n" +
                            "২ । ২ কাপের চাইতে বেশি রক্তপাত  হলে এই অবস্থায় তাৎক্ষণিক চিকিৎসক এর শরণাপন্ন হতে হবে \n",
                    R.drawable.cheese_4),

    };
    //Each Drink has a name, description, and an image resource
    private DataMotherInfo(String info,String description,int imageResourceId) {
        this.info = info;
        this.description = description;
        this.imageResourceId = imageResourceId;
    }
    public String getInfo() {
        return info;
    }
    public String getDescription(){
        return description;
    }
    public int getImageResourceId() {
        return imageResourceId;
    }
    public String toString() {
        return this.info;
    }
}
