package carenbb.com.hackathon.emotion.joton;

/**
 * Created by HP on 28-Mar-16.
 */
public class DataChildDeasesInfo {
    private String info;
    private String description;
    private int imageResourceId;

    public static final DataChildDeasesInfo[] infos = {
            new DataChildDeasesInfo("নবজাতক শিশুর ডিপথেরিয়া",
                    " ডিপথেরিয়ার কারণ, রোগজীবানুর নাম, লক্ষণ, ভয়াবহতা ও প্রতিরোধ \n" +
                            "\n" +
                            "কারণ \n" +
                            "ক্ষুদ্র এক প্রকার জীবাণু ডিপথেরিয়া রোগাক্রান্ত শিশুর হাঁচি কাশির মাধ্যমে বাতাসে ছড়িয়ে পড়ে। ঐ জীবানু যখন সুস্থ শিশুর শরীরে প্রবেশ করে তখন এই রোগ দেখা দিতে পারে।\n" +
                            " \n" +
                            "জীবাণুর নাম \n" +
                            "করিনেব্যাকটেরিয়াম ডিপথেরী Corynebacterium diptherae) ব্যাকটেরিয়া।\n" +
                            " \n" +
                            "লক্ষণ\n" +
                            " ১-৩ দিন:\n" +
                            "•\tশিশু খুব সহজেই ক্লান্ত হয়ে পড়ে\n" +
                            "•\t ঠিকমতো খায় না এবং খেলাধুলা করে না\n" +
                            "•\t শিশুর জ্বর, সর্দি ও কাশি দেখা দেয়\n" +
                            "•\t গলা ফুলে যায় এবং কন্ঠনালী বা গলদেশের ভিতরে সরের মত সাদা আস্তরণ পড়ে।  \n" +
                            "৪-৬ দিন:\n" +
                            "•\tশিশু খুবই দুর্বল হয়ে পড়ে\n" +
                            "•\t কন্ঠনালীর গ্রন্থিগুলি খুব বেশী ফুলে যায়\n" +
                            "•\t কন্ঠনালীতে ধুসর রং এর সুস্পষ্ট আস্তর পড়ে\n" +
                            "•\t আস্তরটি  শ্বাসনালীতে ছড়িয়ে পড়তে পারে এবং শ্বাসকষ্টের সৃষ্টি করে।  \n" +
                            " \n" +
                            "ভয়াবহতা  \n" +
                            "এ রোগ হৃৎপিন্ড এবং স্নায়ুতন্ত্রকে আক্রান্ত করতে পারে এবং শিশুর মৃত্যু ঘটাতে পারে।\n" +
                            " \n" +
                            "প্রতিরোধ  \n" +
                            "শিশুর জম্মের এক বৎসরের মধ্যে ২৮ দিন বা একমাস পর পর তিন ডোজ ডিপিটি টিকা দিলে তা শিশুকে ডিপথেরিয়া থেকে রক্ষা করে । প্রথম ডোজ ডিপিটি টিকা দেয়ার সবচেয়ে ভালো সময় হলো শিশুর ছয় সপ্তাহ বয়সে।\n" +
                            "\n",
                    R.drawable.cheese_2),
            new DataChildDeasesInfo("নবজাতক শিশুর ধনুষ্টংকার",
                    "নবজাতকের (৩ থেকে ২৮ দিন) ধনুষ্টংকারের কারণ, রোগজীবানুর নাম, লক্ষণ, ভয়াবহতা ও প্রতিরোধ  \n" +
                            "\n" +
                            "কারণ  \n" +
                            "পশুর মলের মাধ্যমে নির্গত এই রোগের জীবাণু মাটির সাথে থাকে । এই রোগের জীবাণু কাটাস্থান দিয়ে শরীরে ঢোকে। শিশুর জন্মের পর অপরিষ্কার (জীবাণুযুক্ত) ছুরি বা ব্লেড দিয়ে নাড়ী কাটলে বা নাড়ীতে গোবর বা ময়লা কাপড় ব্যবহার করলে নবজাত শিশুর (৩ থেকে ২৮ দিন) ধনুষ্টংকার রোগ হয়ে থাকে। \n" +
                            "রোগজীবানুর নাম  \n" +
                            "ক্লষ্ট্রিডিয়াম টিটানী (Chকlostridium tetani) ব্যাকটেরিয়া।\n" +
                            "   \n" +
                            "লক্ষণ\n" +
                            " জম্মের ১ম ও ২য় দিন শিশু স্বাভাবিকভাবে কাঁদতে পারে এবং বুকের দুধ টেনে খেতে পারে। জন্মের ৩-২৮ দিনের মধ্যে শিশু অসুস্থ্য হয়ে পড়ে এবং শিশু বুকের দুধ খাওয়া বন্ধ করে দেয়, শিশুর মুখ ও চোয়াল শক্ত হয়ে যায় এবং জোরে কাঁদতে পারে না। শিশুর খিঁচুনী হয় এবং শরীর পেছনের দিকে ধনুকের মতো বাঁকা হয়ে\n" +
                            " \n" +
                            "ভয়াবহতা \n" +
                            " নবজাতকের ধনুষ্টংকার শিশুমৃত্যুর একটি প্রধান কারণ। এই রোগের চিকিৎসা করা অত্যন্ত কষ্টকর। এই রোগে আক্রান্ত নবজাতক প্রায়ই মারা যায়।   প্রতিরোধ  গর্ভবর্তী ও সন্তান ধারণক্ষম সকল মহিলাকে যথাশীঘ্র সম্ভব ৫ ডোজ টিটি টিকা নির্দিষ্ট সময়ের ব্যবধানে দিয়ে নবজাতকের ধনুষ্টংকার রোধ করা যায়। এ ছাড়া নিরাপদ প্রসব ও নাভী কাটার জন্য জীবানুমুক্ত  ব্লেড ব্যবহার করতে হবে। \n" ,
                    R.drawable.cheese_1),
            new DataChildDeasesInfo("নবজাতক শিশুর পোলিও",
                    "পোলিও (পোলিও মাইলাইটিস) এর কারণ, রোগজীবানুর নাম, লক্ষণ, ভয়াবহতা ও প্রতিরোধ \n" +
                            "কারণ  \n" +
                            "আক্রান্ত শিশুর মল দ্বারা দূষিত পানি খেলে বা আক্রান্ত শিশুর সংস্পর্শে এলে এই রোগ হতে পারে।\n" +
                            " \n" +
                            "জীবানুর নাম\n" +
                            "পোলিও ভাইরাস (Polio virus)\n" +
                            " \n" +
                            "লক্ষণ  \n" +
                            "১-৩ দিন:\n" +
                            "•\tশিশুর সর্দি, কাশি এবং সামান্য জ্বর হয়।\n" +
                            " \n" +
                            "১-৫ দিন:\n" +
                            "•\tমাথা ব্যাথা করে, ঘাড় শক্ত হয়ে যায়\n" +
                            "•\tজ্বর থাকে\n" +
                            "•\t শিশুর হাত অথবা পা অবশ হয়ে যায়\n" +
                            "•\t শিশু দাঁড়াতে চায় না\n" +
                            "•\tউঁচু করে ধরলে আক্রান্ত পায়ের পাতা ঝুলে পড়ে\n" +
                            "•\t দাঁড়া করাতে চাইলে শিশু কান্নাকাটি করে এবং নাড়াচড়া করতে পারে না\n" +
                            "•\t শিশুর আক্রান্ত অঙ্গ ক্রমশ দুর্বল হয় এবং পরে স্থায়ীভাবে পঙ্গু হয়ে যেতে পারে।\n" +
                            " \n" +
                            "ভয়াবহতা  \n" +
                            "শিশুর এক বা একাধিক অঙ্গ অবশ হয়ে  য়ায়। ফলে আক্রান্ত অঙ্গ দিয়ে স্বাভাবিক কাজ করতে পারে না । আক্রান্ত অঙ্গের মাংসপেশী চিকন হয়ে যায় । শ্বাস প্রশ্বাসের পেশী অবশ হয়ে শ্বাস বন্ধ হয়ে শিশু মারাও যেতে পারে।\n" +
                            "প্রতিরোধ  \n" +
                            "এক মাস পর তিন ডোজ এবং হামের টিকা দেওয়ার সময় আরো একবার অর্থাৎ মোট চার বার পোলিও টিকা শিশুর এক বছর বয়সের ভিতরে খাওয়ানো হলে তা শিশুর দেহে পোলিও রোগ প্রতিরোধ করে। প্রথম ডোজ দেয়ার সবচেয়ে ভালো সময় শিশুর ৬ সপ্তাহ বয়স। যদি কোন শিশু ক্লিনিক বা হাসপাতালে জন্মগ্রহণ করে তাহলে তাকে জম্মের পর পরই এক ডোজ পোলিও টিকা দিতে হবে। এটাকে অতিরিক্ত ডোজ বলে গণ্য করতে হবে। এবং শিশুর ৬ সপ্তাহ বয়সে থেকে নিয়মিত চার ডোজের সিডিউল শুরু করতে হবে।\n"
                    ,
                    R.drawable.cheese_2),
            new DataChildDeasesInfo("নবজাতক শিশুর যক্ষ্মা",
                    "শিশুদের যক্ষ্মার কারণ, রোগজীবানুর নাম, লক্ষণ, ভয়াবহতা ও প্রতিরোধ \n" +
                            "\n" +
                            "কারণ  \n" +
                            "যক্ষ্মা রোগে আক্রান্ত লোকের সাথে ঘনিষ্ট সংস্পর্শে, আক্রান্ত লোক যখন কাশে তখন তার থুথুর মাধ্যমে এ রোগ ছড়ায় ।\n" +
                            " \n" +
                            "জীবানুর নাম \n" +
                            "মাইকোব্যাকটেরিয়াম টিউবারকুলোসিস ( Mycobacterum Tuberculosis) ।\n" +
                            " \n" +
                            "লক্ষণ  \n" +
                            "•\tঅল্প অল্প জ্বর ও কাশি, ক্ষুধা কমে যায়, দুর্বলতা, গ্রন্থি ফুলে যায়, পরে পেকে যে গ্রন্থি বগল বা ঘাড়ে ক্ষতের সৃষ্টি করে। অনেক দিন ধরে ধীরে ধীরে ওজন কমে যায় ।  হাড় যে কোন হাড়ের জোড়া ফুলে যায় এবং অচল হয়ে যায়। মেরুদন্ডে যক্ষ্মার ফলে বাঁকা  হযে যায়, ব্যাথা হয়।  মস্তিষ্ক (টিভি মেনিনজাইটিস) - এর ফলে মারাত্মক মাথা ব্যথা, অচেতনতা, ঘাড় শক্ত ও খিঁচুনি হয়।\n" +
                            " \n" +
                            "ভয়াবহতা  \n" +
                            "সময়মত সঠিক চিকিৎসা না করলে আক্রান্ত শিশুর মৃত্যু হতে পারে এবং রোগ ছড়াতে পারে।\n" +
                            " \n" +
                            "প্রতিরোধ  \n" +
                            "জম্মের পরপরই যত শীঘ্র সম্ভব বিসিজি টিকা দিলে তা শিশুর দেহে যক্ষ্মার বিরুদ্ধে প্রতিরোধ গড়ে তোলে জন্মের পর পর বিসিজি দেয়া না হলে, শিশুর এক বৎসর বয়সের মধ্যেই এই টিকা গ্রহণ করা উচিত।\n ",
                    R.drawable.cheese_2),
            new DataChildDeasesInfo("নবজাতক শিশুর হাম",
                    " হাম এর কারণ, রোগজীবানুর নাম, লক্ষণ, ভয়াবহতা ও প্রতিরোধ \n" +
                            "\n" +
                            "কারণ  \n" +
                            "হামে আক্রান্ত শিশুর কাছ থেকে এই রোগের জীবানু বাতাসের মাধ্যমে সুস্থ  শিশুর শরীরে প্রবেশ করে এবং হাম রোগ সৃষ্টি করে।\n" +
                            " \n" +
                            "জীবানুর নাম \n" +
                            "হাম ভাইরাস (Measles virus)                                                                         \n" +
                            " \n" +
                            "লক্ষণ  \n" +
                            "১-৩ দিন:\n" +
                            "•\tবেশী জ্বর, সর্দি, কাশি\n" +
                            "•\tচোখ লাল হয়ে যায় এবং পানিতে টল টল করে\n" +
                            "চতুর্থ দিন\n" +
                            "•\tজ্বর কমে আসে\n" +
                            "•\tমুখে এবং শরীরে লালচে দানা দেখা দেয়\n" +
                            " \n" +
                            " হামে দানা উঠার ৩/৪ দিন পর দানা কালচে হয়ে একসময় খুসকির মতো হয়ে ঝরে যায়।\n" +
                            " \n" +
                            "ভয়াবহতা  \n" +
                            "হামের ফলে শিশু নিউমোনিয়া, ডায়রিয়া ও পুষ্টিহীনতায় ভোগে। কান পাকা রোগ হতে পারে। শিশুর রাতকানা রোগ দেখা দিতে পারে, এমনকি চোখ অন্ধ হয়ে যেতে পারে। হামের নানা জটিলতার কারণে অনেক শিশু মারও যায়।\n" +
                            " \n" +
                            "প্রতিরোধ \n" +
                            "শিশুর ৯ মাস বয়স পূর্ণ হওয়ার সাথে সাথে তাকে এক ডোজ হামের টিকা দিলে সে হাম রোগের হাত থেকে রক্ষা পাবে । তবে এই টিকা অবশ্যই এক বৎসর পূর্ণ হওয়ার আগেই দেওয়া উচিত। পুষ্টিহীন শিশুরা হামের পরে মারাত্নক রোগ পরবর্তী জটিলতার সম্মুখীন হয়। পুষ্টিহীন শিশুদের পুষ্টিকর পরিপূরক খাবার দিলে তা তাদেরকে হাম পরবর্তী অন্যান্য রোগ থেকে রক্ষা করতে পারে। হামে আক্রান্ত শিশুকে অবশ্যই এক ডোজ ভিটামিন- এ খাওয়াতে হবে।\n" +
                            "\n",
                    R.drawable.hum),
            new DataChildDeasesInfo("নবজাতক শিশুর হিমোফাইলাস ইনফ্লুয়েঞ্জা-বি ",
                    "হিমোফাইলাস ইনফ্লুয়েঞ্জা-বি (হিব) \n" +
                            "\n" +
                            "কারণ \n" +
                            "হিমোফাইলাস ইনফ্লুয়েঞ্জা-বি এক ধরনের ব্যাকটিরিয়া যা শিশুদের দেহে মারাত্মক সংক্রমণ ঘটায়।\n" +
                            " \n" +
                            "ভয়াবহতা \n" +
                            "•\tএ সংক্রমণের মধ্যে অন্যতম হলো ব্যাকটেরিয়াল ম্যানিনজাইটিস (ব্যাকটেরিয়া জনিত মস্তিষ্কের সংক্রমণ) এবং মারাত্মক নিউমোনিয়া। এছাড়া এ ব্যাকটেরিয়া রক্ত, অস্থি সন্ধি, হাড়, গলা, কান এবং হৃৎপিন্ডের আবরণের সংক্রমণ ঘটায়।\n" +
                            "•\tহিমোফাইলাস ইনফ্লুয়েঞ্জা ‘‘এ,বি,সি,ডি,ই,এফ’’ এই ৬ ধরনের হয়ে থাকে। তবে শিশুদের মারাত্মক সংক্রমণের জন্য ৯০% বেশী ক্ষেত্রে হিমোফাইলাস ইনফ্লুয়েঞ্জা-বি দায়ী।\n" +
                            "•\tসময়মত সঠিক চিকিৎসা না করলে আক্রান্ত শিশু প্রতিবন্ধী হয়ে যেতে পারে,এমনকি মৃত্যুও হতে পারে। কোনো কোনো ক্ষেত্রে সঠিক চিকিৎসার পরেও শিশু মৃত্যুবরণ করতে পারে।\n" +
                            " \n" +
                            "কারা বেশী ঝুঁকিপূর্ণ \n" +
                            "•\tহিমোফাইলাস ইনফ্লুয়েঞ্জা-বি রোগটি সাধারণত ৫ বছরের কম বয়সী শিশুদের হয়ে থাকলেও ৪ থেকে ১৮ মাসের শিশুরাই এ রোগে আক্রান্ত হওয়ার জন্য সবচেয়ে বেশী ঝূঁকিপূর্ণ। \n" +
                            "•\tশিশুর জন্মের পর পর মায়ের দুধের মাধ্যমে এ রোগের বিরুদ্ধে প্রতিরোধ জন্মালেও ২-৩ মাসের মধ্যে তা কমে যায়,তাই যত তাড়াতাড়ি সম্ভব শিশুকে এ রোগের বিরুদ্ধে টিকা দিতে হবে। \n" +
                            "•\tসাধারণত ৫ বছরের বড় শিশুরা বা বয়স্করা এ রোগে আক্রান্ত হয় না। \n" +
                            " \n" +
                            "কিভাবে এ রোগ ছড়ায় \n" +
                            "•\tএ রোগের জীবাণু রোগাক্রান্ত শিশুর হাঁচি কাশির মাধ্যমে বাতাসে ছড়িয়ে পড়ে।\n" +
                            "•\tসুস্থ শিশু আক্রান্ত শিশুর সংস্পর্শে এলে এমনকি আক্রান্ত শিশুর ব্যবহৃত সামগ্রীর (তোয়ালে, খেলনা ইত্যাদি) মাধ্যমে এ জীবাণু শরীরে প্রবেশ করে এবং রোগের সৃষ্টি করে।\n" +
                            " \n" +
                            "প্রতিরোধ \n" +
                            "তিন ডোজ হিমোফাইলাস ইনফ্লুয়েঞ্জা-বি ভ্যকসিন দিয়ে শিশুকে এ রোগ থেকে রক্ষা করা যায়।\n" +
                            " \n" +
                            "টিকা \n" +
                            "•\tইপিআই কার্যক্রমে হিমোফাইলাস ইনফ্লুয়েঞ্জা-বি ভ্যাকসিন অর্ন্তভূক্তির ফলে ডিপিটি এবং হেপাটাইটিস-বি টিকা আলাদা আলাদা না দিয়ে সমন্বিতভাবে ১টি টিকার মাধ্যমে ৫টি রোগের (ডিপথেরিয়া, হুপিংকাশি, ধনুষ্টংকার, হেপাটাইটিস-বি এবং ইনফ্লুয়েঞ্জা-বি) বিরুদ্ধে প্রতিরোধের ব্যবস্থা নেয়া হয়েছে। এই টিকাকে পেন্টাভ্যালেন্ট ভ্যাকসিন বলা হয়।\n" +
                            "•\tপেন্টাভ্যালেন্ট টিকা শুধুমাত্র যেসকল শিশুর বয়স ৬ সপ্তাহ বা ৪২ দিন পূর্ণ হয়েছে তাদেরকে ১ম ডোজ দিয়ে শুরু করতে হবে এবং পরবর্তীতে ৪ সপ্তাহ পর পর ২য় ও ৩য় ডোজ টিকা দিয়ে মোট ৩ ডোজ সম্পূর্ণ করতে হবে।\n" +
                            "•\tসাধারণত ৪-৫ বছর বয়সের মধ্যে শিশুরা স্বাভাবিকভাবে এ রোগের বিরুদ্ধে প্রাকৃতিক প্রতিরোধ গড়ে তোলে,তাই বড়দেরকে সাধারনত এই রোগের জন্য টিকা দেয়ার প্রয়োজন হয় না।\n" +
                            "•\tযদি শিশুর বয়স ৬ সপ্তাহ বা ৪২ দিন পূর্ণ হয় তবে এলাকার নিকটস্থ যে কোনো টিকাদান কেন্দ্র থেকে শিশুকে এই টিকা দিতে হবে।\n" +
                            " \n" +
                            "টিকার পার্শ্বপ্রতিক্রিয়া \n" +
                            "•\tএ টিকার সাধারণ পার্শ্বপ্রতিক্রিয়া হিসাবে সামান্য জ্বর হতে পারে\n" +
                            "•\tটিকা দেয়ার স্থানে সামান্য লাল হওয়া,ফুলে যাওয়া ও অল্প ব্যথা করতে পারে।\n" +
                            "এসব আপনা আপনি ১ থেকে ৩ দিনের মধ্যে সেরে যাবে।\n" +
                            " \n" +
                            "এ টিকা কখন দেয়া যাবে না \n" +
                            "এ টিকার সাধারণত কোনো মারাত্মক বিরূপ প্রতিক্রিয়া নেই। তবে কখনো কখনো পারটুসিস (হুপিংকাশি) উপাদানের কারণে খিঁচুনী হতে পারে। যদি খিঁচুনী হয় তবে তাকে পুনরায় পেন্টাভ্যালেন্ট ভ্যাকসিন না দিয়ে, ৪ সপ্তাহ পর ১ ডোজ টিটি টিকা দিতে হবে।\n" +
                            "\n ",
                    R.drawable.cheese_3),
            new DataChildDeasesInfo("নবজাতক শিশুর হুপিং কাশি",
                    " হুপিং কাশির কারণ, রোগজীবানুর নাম, লক্ষণ, ভয়াবহতা ও প্রতিরোধ \n" +
                            "কারণ  \n" +
                            "হুপিংকাশিতে আক্রান্ত শিশু হাঁচি কাশি দেওয়ার সময় বাতাসের মাধ্যমে এই রোগ ছড়ায় এবং আক্রান্ত শিশুর সংস্পর্শেও এই রোগ ছড়ায়।\n" +
                            " \n" +
                            "জীবাণুর নাম  \n" +
                            "বড়ডেটলা পারটুসিস (Bordetela Pertusis) নামক ব্যাকটেরিয়া।\n" +
                            " \n" +
                            "লক্ষণ \n" +
                            "১ম সপ্তাহ - শিশুর জ্বর হয়, নাক দিয়ে পানি পড়ে, চোখ মুখ লাল হয়ে যায়, কাশি দেখা দেয়।\n" +
                            " \n" +
                            "২য় সপ্তাহ - কাশি মারাত্মক আকার ধারণ করে । শিশু যখন কাশে তখন তার খুব কষ্ট হয় এবং চোখ স্ফীত ও লাল হয়ে যায় । কাশির পর শিশু হুপ শব্দ করে শ্বাস নেয়। অনেক সময় বমিও হয়। ছয় মাসের কম বয়স্ক শিশু হুপ শব্দ ছাড়াও কাশতে পারে এবং বমি করতে পারে । যদি কাশি তিন সপ্তাহের বেশী সময় ধরে চলে তাহলে হুপিং কাশি বলে অনুমান করা যেতে পারে। \n" +
                            "৩ থেকে ৬ সপ্তাহ - কাশি ধীরে ধীরে কমে যায়।\n" +
                            " \n" +
                            "ভয়াবহতা  \n" +
                            "হুপিং কাশির ফলে শিশু দূর্বল হয়ে যায় এবং অপুষ্টিতে ভোগে । শিশুর নিউমোনিয়া হতে পারে শিশুর চোখে রক্ত জমাট বেঁধে অন্ধ হয়ে যেতে পারে । শিশুর মস্তিষ্কের ক্ষতি হতে পারে।\n" +
                            " \n" +
                            "প্রতিরোধ  \n" +
                            "শিশুর এক বছর বয়সের মধ্যে ২৮ দিন বা এক মাস অন্তর অন্তর তিন ডোজ ডিপিটি টিকা দিয়ে শিশুকে হুপিং কাশি থেকে রক্ষা করা যায়। প্রথম ডোজ দেয়ার সমচেয়ে ভালে সময় হলো শিশুর ছয় সপ্তাহ বয়সে। ৬ মাস বয়সের মধ্যেই শিশু মারাত্মকভাবে হুপিং কাশিতে আক্রান্ত হয়ে  থাকে সে কারণে ৬ সপ্তাহ বয়স থেকেই ডিপিটি দেয়া শুরু করা অত্যন্ত জরুরী।\n",
                    R.drawable.cheese_3),
            new DataChildDeasesInfo("নবজাতক শিশুর ডায়রিয়া",
                    " ডায়রিয়াঃ\n" +
                            "            ডায়রিয়া শিশু মৃত্যুর একটি অন্যতম কারণ। বাংলাদেশের প্রেক্ষাপটে বিশেষ করে গ্রামীণ অঞ্চলে ডায়রিয়ার প্রকপ লক্ষণীয়। নবজাতক শিশুর জন্য এটি ভায়াবহ। বিভিন্ন কারনে ডায়রিয়া হতে পারে যেমনঃ \n" +
                            "১। শিশুকে অস্বাস্থ্যকর পরিবেশে রাখলে।\n" +
                            "২। শিশু নোংরা কিছু গিলে ফেললে।\n" +
                            "৩। শিশুকে স্তন পান করানোর সময় মায়ের স্তন অপরিষ্কার থাকলে। \n" +
                            "এছাড়া শিশুকে যারা দেখাশুনা করবে, তাদের পরিচ্ছন্নতার অভাবেও ডায়রিয়া হতে পারে।\n" +
                            "ডায়রিয়ার সাধারন লক্ষণ সমূহঃ\n" +
                            "\t১। শিশুর ঘন ঘন পাতলা পায়খানা হবে। \n" +
                            "\t২। শিশুর বমি হতে পারে।\n" +
                            "\t৩। পেটের চামড়া ঢিলা হয়ে যাবে।\n" +
                            "\t৪। মাথার তালু ডেবে যাবে। \n" +
                            "\t৫।চোখ শুকিয়ে যাবে।\n" +
                            "\n" +
                            "নবজাতক শিশুর জন্য ডায়রিয়া মারাত্মক ক্ষতির কারণ, বেশির ভাগ ক্ষেত্রেই শিশু মৃত্যুর জন্য ডায়রিয়া দায়ী থাকে। ডায়রিয়া হলে শিশুকে বারবার খাবার স্যালাইন খাওয়াতে হবে। খুব তাড়াতাড়ি ডায়রিয়া ভালো না হলে শিশুকে হাসপাতালে নিয়ে যেতে হবে। \n",
                    R.drawable.cheese_3),
            new DataChildDeasesInfo("নবজাতক শিশুর হেপাটাইটিস-বি ",
                    "হেপাটাইটিস-বি \n" +
                            "\n" +
                            "কারণ \n" +
                            "\n" +
                            "•\tহেপাটাইটিস-বি লিভারের একটি মারাত্মক রোগ,যা হেপাটাইটিস-বি ভাইরাস দ্বারা সংক্রমিত হয়। এমনকি অনেক বছর পরও লিভারে মারাত্মক প্রদাহের সৃষ্টি হতে পারে।\n" +
                            "•\tউপযুক্ত পরিবেশে মানব দেহের বাইরেও এই ভাইরাস কমপক্ষে ৭দিন পর্যন্ত কার্যকর থাকে এবং সংক্রমণের ক্ষমতা রাখে।\n" +
                            "•\tহেপাটাইটিস-বি আক্রান্ত রোগীর রক্ত এবং  দেহ রসের মাধ্যমে ছড়ায়।\n" +
                            "সংক্রমণ \n" +
                            "এই ভাইরাস একজন হতে আরেকজনের শরীরে নিম্নলিখিত উপায়ে সংক্রমিত হয়ঃ\n" +
                            "•\tজন্মের সময় নবজাতক তার মায়ের কাছ থেকে সংক্রমিত হতে পারে। মা যদি পূর্বে হেপাটাইটিসে আক্রান্ত থাকে সেক্ষেত্রে শিশুটি যখন তার মায়ের রক্ত বা জরায়ু হতে নিঃসরিত রসের সংস্পর্শে আসে তখনই সংক্রমিত হয়। বুকের দুধের মাধ্যমে এই ভাইরাস সংক্রমিত হয় না।\n" +
                            "•\tখেলাধূলার সময় আঘাতের কারণে হেপাটাইটিস-বি ভাইরাসে আক্রান্ত শিশু হতে রক্ত বা অন্যান্য দেহ রসের মাধ্যমে সুস্থ্য শিশুতে হেপাটাইটিস-বি ভাইরাস সংক্রমিত হতে পারে।\n" +
                            "•\tইনজেকশন দেবার সময় জীবাণুমুক্ত সরঞ্জামাদি ব্যবহার না করলে বা দূষিত রক্ত সঞ্চালনের মাধ্যমে একজন হতে আরেকজন সংক্রমিত হতে পারে।\n" +
                            "•\tঅনিরাপদ যৌন মিলনের মাধ্যমেও এই ভাইরাস সংক্রমিত হতে পারে।\n" +
                            " \n" +
                            "লক্ষণ \n" +
                            "নবজাতক এবং শিশুরাই জীবনের শুরুতেই প্রধানতঃ এ রোগে আক্রান্ত হয়। অধিকাংশ ক্ষেত্রেই শিশুদের মধ্যে হেপাটাইটিস-বি ভাইরাসে আক্রান্তের লক্ষণ প্রতিফলিত হয় না। কিন্তু পরবর্তীতে এসব শিশুরাই হেপাটাইটিস-বি ভাইরাসের দীর্ঘমেয়াদী বাহক হিসেবে থাকে।\n" +
                            " \n" +
                            "প্রথমবারের মত যখন একজন কিশোর/কিশোরী বা প্রাপ্ত বয়স্ক লোক হেপাটাইটিস-বি ভাইরাসে আক্রান্ত হয় তখন তার মধ্যে সাধারণতঃনিম্নলিখিত লক্ষণ সমূহ দেখা যায়:\n" +
                            "•\tচামড়া ও চোখ হলুদ হয়ে যায়। একে জন্ডিস বলে\n" +
                            "•\tপ্রস্রাবের রং হলুদ হয়\n" +
                            "•\tপেটে ব্যথা এবং সেই সাথে জ্বর হয়\n" +
                            "•\tক্ষুধামন্দা এবং বমি বমি ভাব বা বমি হয়ে থাকে\n" +
                            "•\tমাংসপেশী এবং হাড়ের সংযোগস্থলে (গিটে) ব্যথা হয়\n" +
                            "•\tআক্রান্ত ব্যক্তি সবসময় অস্বস্তি অনুভব করে\n" +
                            " \n" +
                            "এখানে বিশেষভাবে উল্লেখ্য যে,হেপাটাইটিসের যে কোন ধরনের ভাইরাস দ্বারা আক্রান্ত হলেই জন্ডিস দেখা যায়। আর হেপাটইটিস-বি ভ্যাকসিন শুধুমাত্র ‘বি’ ভাইরাস দ্বারা আক্রান্ত হওয়া থেকে রক্ষা করে। সুতরাং নিশ্চিত করে বলা যায় না যে, হেপাটাইটিস-বি ভ্যাকসিন দেয়ার পর আর জন্ডিস হবে না। কারণ ‘বি’ ভাইরাস ছাড়াও বাকী ৪ প্রকার (হেপাটাইটিস ‘এ’,‘সি’,‘ডি’ এবং ‘ই’) ভাইরাসে আক্রান্ত হলে জন্ডিস হতে পারে।\n" +
                            " \n" +
                            "ভয়াবহতা \n" +
                            "হেপাটাইটিস ভাইরাসে আক্রান্ত শিশুরাই ভবিষ্যতে হেপাটাইটিস -বি ভাইরাসের দীর্ঘ মেয়াদী বাহক হওয়ার ক্ষেত্রে বেশী ঝুঁকিপূর্ণ এবং অন্যদের মাঝে ভাইরাস সংক্রমিত করে। যার ফলে লিভার সিরোসিস ও লিভার ক্যান্সারের কারণে রোগীর মৃত্যুও হতে পারে।\n" +
                            " \n" +
                            "প্রতিরোধ\n" +
                            "৩ ডোজ হেপাটাইটিস-বি টিকা দিলে  এটি শিশুকে হেপাটাইটিস-বি ভাইরাস থেকে রক্ষা করবে। শিশুর বয়স ৬ সপ্তাহ হলেই  হেপাটাইটিস-বি টিকার ১ম ডোজ দিতে হবে এবং ২৮ দিন বা ১ মাস পরে ২য় ও ৩য় ডোজ হেপাটাইটিস-বি টিকা দিতে হবে। (হেপাটাইটিস-বি টিকা ডিপিটি টিকার সাথে দেয়া হয়)।\n ",
                    R.drawable.hepatitize),

    };
    //Each Drink has a name, description, and an image resource
    private DataChildDeasesInfo(String info,String description,int imageResourceId) {
        this.info = info;
        this.description = description;
        this.imageResourceId = imageResourceId;
    }
    public String getInfo() {
        return info;
    }
    public String getDescription(){
        return description;
    }
    public int getImageResourceId() {
        return imageResourceId;
    }
    public String toString() {
        return this.info;
    }
}
